---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.MaterialId
source: html/bec28291-cbc9-69ea-1196-5ae2f5418886.htm
---
# Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.MaterialId Property

The best material id determined for the family instance.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; }
```